{
    "robotics": "",
    "robotics.motorRun": "Configure la velocidad de los motores M1 y M2, se pueden configurar por separado o juntos.",
    "robotics.motorStop": "Detiene la rotación de los motores M1 y M2, se pueden configurar por separado o juntos.",
    "robotics.servoRun180": "Establezca el ángulo de un servomotor de 180°, rango: 0~180°.",
    "robotics.servoRun360": "Establezca la velocidad de avance y retroceso de un servomotor de 360°, rango: 0~100.",
    "robotics.readUltrasonicData": "Lea la distancia detectada por el sensor ultrasónico, en centímetros.",
    "robotics.readLineTrackingData": "Lea el estado del sensor de seguimiento de línea (valor digital): genera 0 cuando detecta una línea negra y 1 cuando detecta una línea blanca.",
    "robotics.readMoistureData": "Lea el valor de humedad del suelo (valor analógico), rango: 0~1023.",
    "robotics.readDht11Data": "Lea los valores de temperatura y humedad del sensor DHT11. Los valores de temperatura están disponibles en dos unidades: °C y °F. La humedad se expresa en \"%\".",
    "robotics.readLightData": "Lea el valor del sensor de luz ambiental (valor analógico).",
    "robotics.readInfraredData": "Lea el valor detectado por el sensor infrarrojo (valor digital). La salida es 1 cuando se detecta movimiento y 0 cuando no se detecta movimiento.",
    "robotics.ws2812Init": "Establezca el número total de luces RGB.",
    "robotics.ws2812SBrightness": "Establece el brillo de las luces RGB.",
    "robotics.ws2812LedRange": "Configure el número de la luz inicial y final para las luces RGB.",
    "robotics.ws2812SetIndexColor": "Establece el color de visualización para un número de led específico.",
    "robotics.ws2812ShowColor": "Configure el color de visualización para todos los leds.",
    "robotics.ws2812Off": "Apague todos los leds RGB.",
    "robotics.ws2812Shift": "Mueve o transforma el color o estado de la tira de led en x unidades.",
    "robotics.ws2812Rotate": "Alterna el color o el estado de la tira de leds incrementando x unidades.",
    "robotics.ws2812Rainbow": "Configure los leds RGB para mostrar colores degradados; rango: 1~360.",
    "robotics.getWs2812Color": "Configure los colores de luz RGB utilizando colores primarios (rojo, verde, azul)."
}